---
kind: other
id: Properties.T:Autodesk.Revit.DB.DetailLine
source: html/10e7512e-1c91-fd70-9311-fa8aa59c8090.htm
---
# DetailLine Properties

The id of the assembly instance to which the element belongs.